Revit 2026 API

# DividedSurfaceCanBeIntersectionElement Method

---

Checks if the element can be an intersection reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanBeIntersectionElement(
	ElementId id
)
```
```vb
Public Function CanBeIntersectionElement (
	id As ElementId
) As Boolean
```
```cpp
public:
bool CanBeIntersectionElement(
	ElementId^ id
)
```
```fsharp
member CanBeIntersectionElement :
        id : ElementId -> bool
```

#### Parameters

id ElementId
     The element to be checked.

#### Return Value

Boolean True if the element can be an intersection reference., false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The element must be a level, grid, reference plane, or a curve element whose category is lines and reference lines.

#### Reference

DividedSurface Class

Autodesk.Revit.DB Namespace